# Exercise 2 - part 2
This notebook is adapted by Jonathan Schler and Moshe Friedman and based on pandas's "<a href="https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html">10 minutes to pandas</a>" tutorial.

In this tutorial, we will cover:
- Simple dataframe manipulation
- Statistics on data
- Scaling

In [7]:
# we start with the imports as follows:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math
# and ipython definition:
%matplotlib inline

In [8]:
# show several prints in one cell. This will allow us to condence every trick in one cell.
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

## Viewing Data - part 2

In [5]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.794853  1.389041 -0.125118  0.453242
2013-01-02 -0.218601 -0.204660  0.566987 -0.414713
2013-01-03 -1.343931 -1.014141  0.825836 -1.177865
2013-01-04 -0.526255 -0.587595  0.025131  0.110759
2013-01-05  0.236964  0.014863 -0.829162  0.347826
2013-01-06 -1.143864 -0.836809  1.172404 -0.320389

##### Transposing your data

In [4]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.030378    0.501582    0.043358   -0.344132   -1.228015   -0.706866
B   -1.398099    0.101934   -0.077276   -0.660017    1.057671    0.373524
C    0.474915    0.087683   -0.199764    0.728593    0.328044   -0.178831
D    1.841189   -0.408196    0.721479    0.052924    1.307231   -1.913911

##### Sorting by an axis

In [5]:
# axis = 1 --> the columns
# ascending=False --> descending (largest first)
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.841189  0.474915 -1.398099  1.030378
2013-01-02 -0.408196  0.087683  0.101934  0.501582
2013-01-03  0.721479 -0.199764 -0.077276  0.043358
2013-01-04  0.052924  0.728593 -0.660017 -0.344132
2013-01-05  1.307231  0.328044  1.057671 -1.228015
2013-01-06 -1.913911 -0.178831  0.373524 -0.706866

##### Sorting by value
Similar to sorting in a DB or excel table, we could sort by a specific column

In [6]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  1.030378 -1.398099  0.474915  1.841189
2013-01-04 -0.344132 -0.660017  0.728593  0.052924
2013-01-03  0.043358 -0.077276 -0.199764  0.721479
2013-01-02  0.501582  0.101934  0.087683 -0.408196
2013-01-06 -0.706866  0.373524 -0.178831 -1.913911
2013-01-05 -1.228015  1.057671  0.328044  1.307231

## Setting and Editing data

##### Setting a new column automatically aligns the data by the indexes

In [6]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [8]:
# Where is the new column added?
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  1.030378 -1.398099  0.474915  1.841189  NaN
2013-01-02  0.501582  0.101934  0.087683 -0.408196  1.0
2013-01-03  0.043358 -0.077276 -0.199764  0.721479  2.0
2013-01-04 -0.344132 -0.660017  0.728593  0.052924  3.0
2013-01-05 -1.228015  1.057671  0.328044  1.307231  4.0
2013-01-06 -0.706866  0.373524 -0.178831 -1.913911  5.0

##### Setting values by label

In [9]:
df.at[dates[0],'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -1.398099  0.474915  1.841189  NaN
2013-01-02  0.501582  0.101934  0.087683 -0.408196  1.0
2013-01-03  0.043358 -0.077276 -0.199764  0.721479  2.0
2013-01-04 -0.344132 -0.660017  0.728593  0.052924  3.0
2013-01-05 -1.228015  1.057671  0.328044  1.307231  4.0
2013-01-06 -0.706866  0.373524 -0.178831 -1.913911  5.0

##### Setting values by position

In [10]:
df.iat[0,1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.474915  1.841189  NaN
2013-01-02  0.501582  0.101934  0.087683 -0.408196  1.0
2013-01-03  0.043358 -0.077276 -0.199764  0.721479  2.0
2013-01-04 -0.344132 -0.660017  0.728593  0.052924  3.0
2013-01-05 -1.228015  1.057671  0.328044  1.307231  4.0
2013-01-06 -0.706866  0.373524 -0.178831 -1.913911  5.0

##### Setting by assigning with a numpy array

In [11]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.474915  5  NaN
2013-01-02  0.501582  0.101934  0.087683  5  1.0
2013-01-03  0.043358 -0.077276 -0.199764  5  2.0
2013-01-04 -0.344132 -0.660017  0.728593  5  3.0
2013-01-05 -1.228015  1.057671  0.328044  5  4.0
2013-01-06 -0.706866  0.373524 -0.178831  5  5.0

##### A where operation with setting.

In [12]:
df2 = df.copy()

In [13]:
df2[df2 > 0] = -df2

In [14]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.474915 -5  NaN
2013-01-02 -0.501582 -0.101934 -0.087683 -5 -1.0
2013-01-03 -0.043358 -0.077276 -0.199764 -5 -2.0
2013-01-04 -0.344132 -0.660017 -0.728593 -5 -3.0
2013-01-05 -1.228015 -1.057671 -0.328044 -5 -4.0
2013-01-06 -0.706866 -0.373524 -0.178831 -5 -5.0

### Filling missing data

In [15]:
df2.fillna(value=12)

                   A         B         C  D     F
2013-01-01  0.000000  0.000000 -0.474915 -5  12.0
2013-01-02 -0.501582 -0.101934 -0.087683 -5  -1.0
2013-01-03 -0.043358 -0.077276 -0.199764 -5  -2.0
2013-01-04 -0.344132 -0.660017 -0.728593 -5  -3.0
2013-01-05 -1.228015 -1.057671 -0.328044 -5  -4.0
2013-01-06 -0.706866 -0.373524 -0.178831 -5  -5.0

### Applying a method on the data

In [16]:
df2 = df2.fillna(value=12)
df2['F_PLUS1'] = df2['F'].apply(lambda x: x+1)
df2[['F','F_PLUS1']]

               F  F_PLUS1
2013-01-01  12.0     13.0
2013-01-02  -1.0      0.0
2013-01-03  -2.0     -1.0
2013-01-04  -3.0     -2.0
2013-01-05  -4.0     -3.0
2013-01-06  -5.0     -4.0

### Short exercise 
Apply your own method

## Merge Dataframes

### Concat

pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the [Merging section](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging)

Concatenating pandas objects together with concat():

In [17]:
df_cars_lt_hd5 = pd.read_csv('cars_lt_hd5.csv').set_index('Car')
df_cars_lt_tl5 = pd.read_csv('cars_lt_tl5.csv').set_index('Car')
df_cars_lt_hd5.head(2)
df_cars_lt_tl5.head(2)

                            MPG  Cylinders  Displacement  Horsepower
Car
Chevrolet Chevelle Malibu  18.0          8         307.0       130.0
Buick Skylark 320          15.0          8         350.0       165.0

                   Cylinders  Displacement  Horsepower  Weight
Car
Ford Mustang GL            4         140.0        86.0  2790.0
Volkswagen Pickup          4          97.0        52.0  2130.0

In [18]:
pd.concat([df_cars_lt_hd5,df_cars_lt_tl5])

                            MPG  Cylinders  Displacement  Horsepower  Weight
Car
Chevrolet Chevelle Malibu  18.0          8         307.0       130.0     NaN
Buick Skylark 320          15.0          8         350.0       165.0     NaN
Plymouth Satellite         18.0          8         318.0       150.0     NaN
AMC Rebel SST              16.0          8         304.0       150.0     NaN
Ford Torino                17.0          8         302.0       140.0     NaN
Ford Mustang GL             NaN          4         140.0        86.0  2790.0
Volkswagen Pickup           NaN          4          97.0        52.0  2130.0
Dodge Rampage               NaN          4         135.0        84.0  2295.0
Ford Ranger                 NaN          4         120.0        79.0  2625.0
Chevy S-10                  NaN          4         119.0        82.0  2720.0

### Join
SQL style merges. See the [Database style joining](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [19]:
df_cars_lt = pd.read_csv('cars_lt_0_9.csv')
df_cars_rt = pd.read_csv('cars_rt_1_10.csv')
df_cars_lt.head(2)
df_cars_rt.head(2)

                         Car   MPG  Cylinders  Displacement  Horsepower
0  Chevrolet Chevelle Malibu  18.0          8         307.0       130.0
1          Buick Skylark 320  15.0          8         350.0       165.0

                  Car  Weight  Acceleration  Model Origin
0   Buick Skylark 320  3693.0          11.5     70     US
1  Plymouth Satellite  3436.0          11.0     70     US

In [20]:
df_cars_lt.tail(2)
df_cars_rt.tail(2)

                  Car   MPG  Cylinders  Displacement  Horsepower
8    Pontiac Catalina  14.0          8         455.0       225.0
9  AMC Ambassador DPL  15.0          8         390.0       190.0

                    Car  Weight  Acceleration  Model  Origin
8    AMC Ambassador DPL  3850.0           8.5     70      US
9  Citroen DS-21 Pallas  3090.0          17.5     70  Europe

In [21]:
df_cars_lt.shape
df_cars_rt.shape
pd.merge(df_cars_lt, df_cars_rt, on='Car')

(10, 5)

(10, 5)

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Buick Skylark 320,15.0,8,350.0,165.0,3693.0,11.5,70,US
1,Plymouth Satellite,18.0,8,318.0,150.0,3436.0,11.0,70,US
2,AMC Rebel SST,16.0,8,304.0,150.0,3433.0,12.0,70,US
3,Ford Torino,17.0,8,302.0,140.0,3449.0,10.5,70,US
4,Ford Galaxie 500,15.0,8,429.0,198.0,4341.0,10.0,70,US
5,Chevrolet Impala,14.0,8,454.0,220.0,4354.0,9.0,70,US
6,Plymouth Fury iii,14.0,8,440.0,215.0,4312.0,8.5,70,US
7,Pontiac Catalina,14.0,8,455.0,225.0,4425.0,10.0,70,US
8,AMC Ambassador DPL,15.0,8,390.0,190.0,3850.0,8.5,70,US

### Append

Append rows to a dataframe. See the [Appending](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)

In [22]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.403566 -0.235997 -0.393243 -2.092064
1 -0.621728 -1.035471  1.239342 -1.114213
2  0.722539 -0.511101  0.728315  1.507661
3 -0.454095  1.988670 -0.022592  0.916457
4 -0.323097 -0.022719  0.234206 -0.026875
5  0.869804 -1.148121 -0.405170 -0.858583
6  0.153281 -0.543654 -0.396817 -0.251219
7 -1.025388  0.436708  0.518578  0.198175

In [23]:
s = df.iloc[3]
s

A   -0.454095
B    1.988670
C   -0.022592
D    0.916457
Name: 3, dtype: float64

In [24]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.403566 -0.235997 -0.393243 -2.092064
1 -0.621728 -1.035471  1.239342 -1.114213
2  0.722539 -0.511101  0.728315  1.507661
3 -0.454095  1.988670 -0.022592  0.916457
4 -0.323097 -0.022719  0.234206 -0.026875
5  0.869804 -1.148121 -0.405170 -0.858583
6  0.153281 -0.543654 -0.396817 -0.251219
7 -1.025388  0.436708  0.518578  0.198175
8 -0.454095  1.988670 -0.022592  0.916457

### Statstics on the data

Describe shows a quick statistic summary of your data

In [25]:
df.describe()

              A         B         C         D
count  8.000000  8.000000  8.000000  8.000000
mean  -0.034390 -0.133961  0.187827 -0.215083
std    0.676555  1.000381  0.607657  1.146506
min   -1.025388 -1.148121 -0.405170 -2.092064
25%   -0.496003 -0.666608 -0.394137 -0.922491
50%   -0.084908 -0.373549  0.105807 -0.139047
75%    0.483310  0.092138  0.571012  0.377745
max    0.869804  1.988670  1.239342  1.507661

Performing a descriptive statistic

In [26]:
df.mean()

A   -0.034390
B   -0.133961
C    0.187827
D   -0.215083
dtype: float64

Same operation on the other axis

In [27]:
df.mean(1)

0   -0.579435
1   -0.383017
2    0.611854
3    0.607110
4   -0.034621
5   -0.385517
6   -0.259602
7    0.032018
dtype: float64

### Histogramming

See more at [Histogramming and Discretization](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization)

In [28]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    2
1    0
2    3
3    6
4    6
5    6
6    4
7    1
8    2
9    0
dtype: int32

In [29]:
s.value_counts()

6    3
2    2
0    2
4    1
3    1
1    1
dtype: int64